In [99]:
people = {
    "first" : ["Jane", "John", "Tommy"],
    "last" : ["doe", "doe", "White"],
    "email" : ["janedoe@gmail.com", "johndoe@gmail.com", "tommy@yahoo.com"]
}

In [100]:
people['first']

['Jane', 'John', 'Tommy']

In [101]:
import pandas as pd

In [102]:
df = pd.DataFrame(people)

In [103]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [104]:
df[['first', 'email']]

   first              email
0   Jane  janedoe@gmail.com
1   John  johndoe@gmail.com
2  Tommy    tommy@yahoo.com

In [105]:
type(df['email'])

pandas.core.series.Series

In [106]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [107]:
df.iloc[[0, 1]]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [108]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [109]:
df.loc[[0, 1], ['first', 'email']]

  first              email
0  Jane  janedoe@gmail.com
1  John  johndoe@gmail.com

In [110]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [44]:
df['last'] == "doe"

0     True
1     True
2    False
Name: last, dtype: bool

In [45]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [46]:
filt = (df['last'] == 'doe') & (df['first'] == 'Jane') # filter | Print email's that are equal to ... 
my_filter = (df['last'] == 'White') & (df['first'] == 'Tommy')

In [47]:
df[filt] # print the data frame of "filt"
df.loc[my_filter, ['last', 'first']]

    last  first
2  White  Tommy

In [48]:
df.loc[filt, ['last', 'email']] # print the data frame of "filt" by location .

  last              email
0  doe  janedoe@gmail.com

In [49]:
tommy = df.loc[my_filter, ['first', 'last']]

In [50]:
tommy

   first   last
2  Tommy  White

In [51]:
filt = (df['last'] != 'doe') & (df['first'] != 'Jane')

In [52]:
df[~filt]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [53]:
df['email'] = df['email'].str.lower()

In [54]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [55]:
df['email'].apply(len)

0    17
1    17
2    15
Name: email, dtype: int64

In [56]:
df['email'].apply(lambda x: x.lower())

0    janedoe@gmail.com
1    johndoe@gmail.com
2      tommy@yahoo.com
Name: email, dtype: object

In [57]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [58]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [59]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [60]:
len(df['email'])

3

In [61]:
df.apply(lambda x: x.max())

first              Tommy
last                 doe
email    tommy@yahoo.com
dtype: object

In [62]:
df.applymap(len)

   first  last  email
0      4     3     17
1      4     3     17
2      5     5     15

In [63]:
df = df.applymap(lambda x: x.lower())

In [64]:
df

   first   last              email
0   jane    doe  janedoe@gmail.com
1   john    doe  johndoe@gmail.com
2  tommy  white    tommy@yahoo.com

In [65]:
df['first'] + ' ' + df['last'] + ' and the email is: ' + df['email']

0     jane doe and the email is: janedoe@gmail.com
1     john doe and the email is: johndoe@gmail.com
2    tommy white and the email is: tommy@yahoo.com
dtype: object

In [66]:
df['full_name'] = df['first'] + ' ' + df['last']

In [67]:
df

   first   last              email    full_name
0   jane    doe  janedoe@gmail.com     jane doe
1   john    doe  johndoe@gmail.com     john doe
2  tommy  white    tommy@yahoo.com  tommy white

In [68]:
df.drop(columns=['first','last'], inplace=True)

In [69]:
df

               email    full_name
0  janedoe@gmail.com     jane doe
1  johndoe@gmail.com     john doe
2    tommy@yahoo.com  tommy white

In [76]:
df['full_name'].str.split(' ')

0       [jane, doe]
1       [john, doe]
2    [tommy, white]
Name: full_name, dtype: object

In [77]:
df['full_name'].str.split(' ', expand=True)

       0      1
0   jane    doe
1   john    doe
2  tommy  white

In [78]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)

In [79]:
df

               email    full_name  first   last
0  janedoe@gmail.com     jane doe   jane    doe
1  johndoe@gmail.com     john doe   john    doe
2    tommy@yahoo.com  tommy white  tommy  white

In [80]:
df.drop(columns={'full_name'})

               email  first   last
0  janedoe@gmail.com   jane    doe
1  johndoe@gmail.com   john    doe
2    tommy@yahoo.com  tommy  white

In [83]:
df.append({'first':'tarokh'}, ignore_index=True)

               email    full_name   first   last
0  janedoe@gmail.com     jane doe    jane    doe
1  johndoe@gmail.com     john doe    john    doe
2    tommy@yahoo.com  tommy white   tommy  white
3                NaN          NaN  tarokh    NaN

In [95]:
users = {
    "first" : ["Tony", "tarokh"],
    "last" : ["stark", "yaghoubi"],
    "email" : ["mrstark@gmail.com", "tarokh@gmail.com"]
}

df2 = pd.DataFrame(users)

In [96]:
df2

    first      last              email
0    Tony     stark  mrstark@gmail.com
1  tarokh  yaghoubi   tarokh@gmail.com

In [114]:
df.append(df2, ignore_index=True, sort=False)

    first      last              email
0    Jane       doe  janedoe@gmail.com
1    John       doe  johndoe@gmail.com
2   Tommy     White    tommy@yahoo.com
3    Tony     stark  mrstark@gmail.com
4  tarokh  yaghoubi   tarokh@gmail.com

In [115]:
df = df.append(df2, ignore_index=True, sort=False)

In [116]:
df

    first      last              email
0    Jane       doe  janedoe@gmail.com
1    John       doe  johndoe@gmail.com
2   Tommy     White    tommy@yahoo.com
3    Tony     stark  mrstark@gmail.com
4  tarokh  yaghoubi   tarokh@gmail.com

In [118]:
df.drop(index=4)

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com
3   Tony  stark  mrstark@gmail.com

In [119]:
df.drop(index=4, inplace=True)

In [121]:
df.drop(index=df[df['last'] == 'doe'].index) # drop the rows with a condition

   first   last              email
2  Tommy  White    tommy@yahoo.com
3   Tony  stark  mrstark@gmail.com